# quiz.tsv の中で不適な問題を除外するコード

import csv

input_file = "quiz.tsv"
output_file = "quiz_refine.tsv"

ng_words = ["今年", "去年", "昨年", "現", "前", "確率", "漢字", "200"]

# カタカナにした時に一意に定まらないもの
yure_words = ["日本"]


# 問題が複数の答えを要求しているかどうか判定
def is_which_problem(problem):
    num_nani = 0
    for s in problem:
        if s == "何":
            num_nani += 1
    if num_nani > 1:
        return True
    else:
        return False


# 答えが「〜月〜日」かどうか判別
def is_answer_month_date(answer):
    flag_month = 0
    flag_date = 0
    for s in answer:
        if s == "月":
            flag_month = 1
        if s == "日":
            flag_date = 1
    if flag_date == 1 and flag_month == 1:
        return True
    else:
        return False


# Mecubでうまくできなかったカナを直す
dic_kana = {
    "日本刀": "ニホントウ",
    "序二段": "ジョニダン",
    "大喜利(大切り)": "オオギリ",
    "飛雲閣": "ヒウンカク",
    "三題噺(ばなし)": "サンダイバナシ",
    "白州": "ハクシュウ",
    "韋駄天": "イダテン",
    "辛亥革命": "シンガイカクメイ",
    "辛亥(しんがい)革命": "シンガイカクメイ",
    "『オール讀物』": "オールヨミモノ",
    "笠谷幸生": "カサヤユキオ",
    "加藤高明": "カトウタカアキ",
    "辮髪、べんぱつ": "べんばつ",
    "王維": "オウイ",
    "承久の乱": "ジョウキュウノラン",
    "津本陽": "ツモトヨウ",
    "徳永直": "トクナガスナオ",
    "三毛猫": "ミケネコ",
    "呑(ノミ)行為": "ノミ",
    "藤原純友(すみとも)": "フジワラノスミトモ",
    "炎色反応": "エンショクハンノウ",
    "ピッチ走法": "ピッチソウホウ",
    "太占": "フトマニ",
    "托卵": "タクラン",
    "甲本ヒロト": "コウモトヒロト",
    "宮地真緒": "ミヤジマオ",
    "頓服、頓服薬": "トンプク",
    "(海上)七里の渡し": "シチリノワタシ",
    "岸信介": "キシノブスケ",
    "ダッチ(マン)": "ダッチ",
    "開けゴマ": "ヒラケゴマ",
    "けり(がつく)": "ケリ",
    "『荒ぶる』": "アラブル",
    "浜口雄幸(おさち)": "ハマグチオサチ",
    "持統天皇": "ジトウテンノウ",
    "スカウト(アイボリー・ハンター)": "スカウト",
    "山月記": "サンゲツキ",
    "身欠き鰊(にしん)": "ミガキニシン",
    "中性子、ニュートロン": "中性子",
    "高知龍馬空港": "コウチリョウマクウコウ",
    "(株式会社)東ハト": "トウハト",
    "逆手(さかて・ぎゃくて)": "サカテ",
    "なかにし礼": "ナカニシレイ",
    "保元の乱": "ホウゲンノラン",
    "空(くう)集合": "クウシュウゴウ",
    "『種の起源』": "シュノキゲン",
    "メッキがはげる": "メッキ",
    "外合": "ガイゴウ",
    "済州島(さいしゅうとう・チェジュとう・チェジュド)": "サンシュウトウ",
    "楳図かずお": "ウメズカズオ",
    "楳図かずお[うめず・かずお]": "ウメズカズオ",
    "関羽": "カンウ",
    "田中美里(みさと)": "タナカミサト",
    "高認": "コウニン",
    "楚": "ソ",
    "小林旭": "コバヤシアキラ",
    "ニセコ町(ちょう)": "ニセコ",
    "第9条": "9",
    "Iターン": "I",
    "JASRAC(ジャスラック)": "JASRAC",
    "青木宣親(のりちか)": "アオキノリチカ",
    "9(ミリメートル)": "9",
    "上田秋成(あきなり)": "ウエダアキナリ",
    "四代目": "4",
    "JARO(ジャロ)": "JARO",
    "横峯良郎(よしろう)": "ヨコミネヨシロウ",
    "天暦(てんりゃく)の治": "テンリャクノチ",
    "一気通貫": "イッキツウカン",
    "高麗": "こうらい",
    "Uボート": "U",
    "足利義稙(よしたね)": "アシカガヨシタネ",
    "外心": "ガイシン",
    "須弥山": "シュミセン",
    "皇極天皇": "コウギョクテンノウ",
    "海山商事": "ウミヤマショウジ",
    "汽水湖(brackish lake)": "キスイコ",
    "片山哲": "カタヤマテツ",
    "スウォッシュ(マーク)": "スウォッシュ",
    "『リンゴ追分(おいわけ)』": "リンゴオイワケ",
    "皿鉢(さわち)料理": "サワチリョウリ",
    "ソフトバンク(モバイル)": "ソフトバンク",
    "味蕾[みらい]": "ミライ",
    "押っ取り刀[おっとりがたな]": "オットリガタナ",
    "カーキ色[khaki]": "カーキ",
    "ロケット(ペンダント)[locket pendant]": "ロケット",
    "『礼記[らいき]』": "ライキ",
    "倭寇[わこう]": "ワコウ",
    "外分泌": "ガイブンピツ",
    "米騒動": "コメソウドウ",
    "嫌気(的)呼吸": "ケンキコキュウ",
    "盲牌[もうぱい]": "モウパイ",
    "移牧": "イボク",
    "卑弥呼[ひみこ]": "ヒミコ",
    "呑(ノミ)行為": "ノミ",
    "琴": "コト",
}

with open(input_file, newline="") as input_f:
    with open(output_file, "w") as output_f:
        tsv = csv.writer(output_f, delimiter="\t", lineterminator="\n")

        for qid, problem, answer, answer_kana in csv.reader(input_f, delimiter="\t"):
            if answer in dic_kana:
                answer_kana = dic_kana[answer]
            if len(answer_kana) < 1 or len(answer_kana) > 10:
                continue
            if any(word in problem for word in ng_words):
                continue
            if "." in answer:  # 少数を答える問題は省く
                continue
            if any(word in answer for word in yure_words):
                continue
            if is_which_problem(problem):
                continue
            if is_answer_month_date(answer):
                continue

            tsv.writerow([qid, problem, answer, answer_kana])
